Revit 2024 API
TableCellStyle.BorderBottomLineStyle Property
 The element id (GraphicsStyle element) for the bottom line of the cell border.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ElementId BorderBottomLineStyle { get; set; }
Visual Basic
Public Property BorderBottomLineStyle As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ BorderBottomLineStyle {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
TableCellStyle Class
Autodesk.Revit.DB Namespace